app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
SELECT COUNT(*) FROM "activities"
---
  def show_random
    @activity = Activity.all[rand(Activity.count)]